Merge pull request #1 from krystianslowik/feat/grpc-migration
feat/grpc migration
